app/controllers/notes_controller.rb

INSERT INTO "notes" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "first note"], ["created_at", Sat, 28 Sep 2013 20:55:12 UTC +00:00], ["updated_at", Sat, 28 Sep 2013 20:55:12 UTC +00:00]]
---
  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save